Repository: ufukhawk/exchange_app
Catalog: lib/l10n/app_*.arb
Languages: tr

# appTitle
source: Exchange Rates
tr: Döviz Veriler

source: Exchange Rates
tr: Döviz Kurları

source: Converter
tr: Çevirici

source: Settings
tr: Ayarlar

source: Select Date
tr: Seçili Tarih

source: Select Date Range
tr: Tarih Aralığı Seç

source: Start Date
tr: Başlangıç Tarihi

source: End Date
tr: Bitiş Tarihi

source: Apply
tr: Uygula

source: Cancel
tr: İptal

source: Enter Amount
tr: Tutar Giriniz

# tryAmount
source: Turkish Lira (â‚º)
tr: Türk Lirası (₺)

# currencyCode
source: Currency
tr: Para Birimi

# buyingRate
source: Buying
tr: Alış

# sellingRate
source: Selling
tr: Satış

source: Forex Buying
tr: Döviz Alış

source: Forex Selling
tr: Döviz Satış

source: Banknote Buying
tr: Efektif Alış

source: Banknote Selling
tr: Efektif Satış

source: Theme
tr: Karanlık Mod

source: Language
tr: Dil

source: Light
tr: Açık

source: Dark
tr: Koyu

source: English
tr: İngilizce

source: Turkish
tr: Türkçe

source: No Internet Connection
tr: İnternet Bağlantısı Yok

# checkYourConnection
source: Please check your internet connection
tr: Lütfen internet bağlantınızı kontrol edin

source: Retry
tr: Tekrar Dene

source: Error
tr: Hata

source: Loading exchange rates...
tr: Döviz kurları yükleniyor...

source: No data available
tr: Veri bulunamadı

source: Screenshot Detected
tr: Ekran Görüntüsü Algılandı

# screenshotWarning
source: Screenshots are not allowed in this app for security reasons
tr: Güvenlik nedeniyle bu uygulamada ekran görüntüsü alınamaz

source: Screen Recording Detected
tr: Ekran Kaydı Algılandı

# screenRecordingWarning
source: Screen recording is not allowed in this app for security reasons
tr: Güvenlik nedeniyle bu uygulamada ekran kaydı yapılamaz

source: Date
tr: Tarih

source: Rates
tr: Kurlar

source: Convert
tr: Çevir

source: Converted Amounts
tr: Çevrilmiş Tutarlar

# lastUpdate
source: Update
tr: Güncelleme

source: Equivalent
tr: Karşılık

# previousDayData
source: Showing yesterday's data
tr: Dünün verileri gösteriliyor

# publicationTime
source: Rates published daily at 15:30
tr: Kurlar her gün 15:30'da yayınlanır

# weekendDataNotAvailable
source: Exchange rates are not available for weekends
tr: Hafta sonları için kur bilgisi mevcut değildir

# futureDateNotAvailable
source: Exchange rates are not available for future dates
tr: Gelecek tarihler için kur bilgisi mevcut değildir

# showingLastBusinessDay
source: Showing the last business day rates
tr: En son iş gününün kurları gösterilmektedir

# dataNotAvailableForDate
source: Exchange rate data is not available for this date
tr: Bu tarih için kur bilgisi mevcut değildir

# errorDataNotFound
source: Data not found for the selected date
tr: Seçilen tarih için veri bulunamadı

# errorServerNotResponding
source: Server is not responding. Please try again later
tr: Sunucu şu anda yanıt veremiyor. Lütfen daha sonra tekrar deneyin

# errorDataCouldNotBeRetrieved
source: Data could not be retrieved. Please try again
tr: Veriler alınamadı. Lütfen tekrar deneyin

# errorCheckInternetConnection
source: Please check your internet connection
tr: İnternet bağlantınızı kontrol edin

# errorConnectionTimeout
source: Connection timeout. Please try again
tr: Bağlantı zaman aşımına uğradı. Lütfen tekrar deneyin

# errorConnectionFailed
source: Connection failed. Please try again
tr: Bağlantı hatası oluştu. Lütfen tekrar deneyin

# errorUnexpected
source: An unexpected error occurred. Please try again
tr: Beklenmeyen bir hata oluştu. Lütfen tekrar deneyin

# changeDate
source: Change
tr: Değiştir

source: Version
tr: Versiyon

source: Data Source
tr: Veri Kaynağı

# fastExchange
source: Fast Exchange(TL)
tr: Hızlı Çeviri (TL)

source: Restart
tr: Yeniden Başlat

# restartRequired
source: Restart required to apply changes to State Management
tr: State Management ayarını değiştirmek için uygulamayı yeniden başlatmalısınız.

# screenshotDetectedTitle
source: Screenshot Detected
tr: Ekran Görüntüsü Algılandı

# screenshotDetectedMessage
source: Screenshots are not allowed in this app for security reasons.
tr: Güvenlik nedeniyle bu uygulamada ekran görüntüsü alınamaz.

# screenRecordingActiveTitle
source: Screen Recording Active
tr: Ekran Kaydı Aktif

# screenRecordingActiveMessage
source: Screen recording is not allowed. Content is hidden for security.
tr: Güvenlik nedeniyle ekran kaydı yapılamaz. İçerik gizlendi.

source: Understood
tr: Anladım

source: Security Warning
tr: Güvenlik Uyarısı
